# Pandas First Exercises
Dear Students this notebook contains simple exercises for beginners to practice basic Pandas operations such as creating Series, DataFrames, saving files, and importing data.

### Exercise 1: Creating Pandas Series

1. Create a Pandas Series containing the marks of 5 students in Maths.
2. Create a Pandas Series that stores 5 city names.
3. Create a Pandas Series with 5 different floating-point numbers representing temperature readings.

In [3]:
import pandas as pd
Maths_Marks = pd.Series([98,65,79,91,99])
Maths_Marks

0    98
1    65
2    79
3    91
4    99
dtype: int64

In [16]:
city = pd.Series(['Delhi', 'mumbai','kolkata','Banglore','Noida'])
city

0       Delhi
1      mumbai
2     kolkata
3    Banglore
4       Noida
dtype: object

In [17]:
temperature = pd.Series([9.7,14.2,37.5,22.6,15.2])
temperature

0     9.7
1    14.2
2    37.5
3    22.6
4    15.2
dtype: float64

### Exercise 2: Creating DataFrames from Series

1. Create two Series: one containing student names and another containing their ages. Combine them into a single DataFrame.
2. Create three Series: 'Product Name', 'Price', and 'Quantity'. Combine them into one DataFrame and display it.

In [27]:
#answer here
Student_name = pd.Series (['Aditya','Manish','Avinash','Akhilesh', 'Abhishek'])
Student_ages = pd.Series ([25,23,25,26,22])
df= pd.concat([ Student_name, Student_ages], axis=1)
df.columns = (['Student_name','Student_ages'])
df

  Student_name  Student_ages
0       Aditya            25
1       Manish            23
2      Avinash            25
3     Akhilesh            26
4     Abhishek            22

In [5]:

Product_Name = pd.Series(['Apple','raw mango','Banana','Guwawa','Pineapple'])
Price = pd.Series([120,80,60,80,140])
Quantity = pd.Series([2,8,6,12,2])
df = pd.concat([Product_Name,Price,Quantity], axis= 1)
df

           0    1   2
0      Apple  120   2
1  raw mango   80   8
2     Banana   60   6
3     Guwawa   80  12
4  Pineapple  140   2

### Exercise 3: Creating DataFrames from Dictionaries

1. Create a dictionary with keys as 'Name', 'Age', and 'City', each containing a list of 3 values. Convert it into a DataFrame.
2. Create a dictionary with keys 'Product', 'Category', and 'Price'. Convert it into a DataFrame and print it.

In [7]:
#answer here
Person = {
'Name' : ['Avishkar','Shubham','priya','palak','muskan'],
'Age' : [25,22,19,20,23],
'City': ['Delhi','Noida','Pitampura','banaras','Bhopal']
}
df = pd.DataFrame(Person)
df

       Name  Age       City
0  Avishkar   25      Delhi
1   Shubham   22      Noida
2     priya   19  Pitampura
3     palak   20    banaras
4    muskan   23     Bhopal

In [10]:
Super_market ={
    'Product' :['milk','Apple','capsicum','Toothbrush','chocolate'],
    'Category' : ['dairy','fruit','vegetable','dailyneeed','grocery'],
    'Price':[120,100,60,50,180]
}
dfl = pd.DataFrame(Super_market)
dfl

      Product    Category  Price
0        milk       dairy    120
1       Apple       fruit    100
2    capsicum   vegetable     60
3  Toothbrush  dailyneeed     50
4   chocolate     grocery    180

### Exercise 4: Saving DataFrames to CSV and Excel

1. Save any one of your created DataFrames into a CSV file named 'students.csv'.
2. Save another DataFrame into an Excel file named 'products.xlsx'.

In [11]:
#answer here
dfl.to_csv('students.csv')

In [12]:
df.to_excel('products.xlsx')

### Exercise 5: Reading Data from Files

1. Use Pandas to read the CSV file 'students.csv' that you created earlier.
2. Use Pandas to read the Excel file 'products.xlsx' that you created earlier.

In [19]:
#answer here
v = pd.read_csv(r"C:\Users\Lenovo\OneDrive\Desktop\pandas mini assingment\students.csv", index_col=0)
v

      Product    Category  Price
0        milk       dairy    120
1       Apple       fruit    100
2    capsicum   vegetable     60
3  Toothbrush  dailyneeed     50
4   chocolate     grocery    180

In [20]:
var = pd.read_excel(r"C:\Users\Lenovo\OneDrive\Desktop\pandas mini assingment\products.xlsx",index_col=0)
var

      Product    Category  Price
0        milk       dairy    120
1       Apple       fruit    100
2    capsicum   vegetable     60
3  Toothbrush  dailyneeed     50
4   chocolate     grocery    180